# -*-mode:ruby-*- vim:ft=ruby

# ~/.Brewfile
# =============================================================================
# Project dependencies installed using `brew bundle` or `~/dotfiles.sh`.
#
# See https://github.com/Homebrew/homebrew-bundle

tap "buo/cask-upgrade"
tap "eugenmayer/dockersync"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
#tap "twpayne/taps"

brew "asdf"                                 # Extendable version manager
brew "autoconf"                             # Configuration shell script maker
brew "bash"                                 # Bourne again shell
brew "bash-completion"                      # Autocompletions for `bash`
brew "colordiff"                            # Colour-highlighted diff output
brew "direnv"                               # Directory specific env variables
brew "flake8"                               # Python style guide enforcer
brew "fswatch"                              # File change monitor
brew "geoip"                                # Geographic IP lookup
brew "gnupg"                                # GNU privacy guard
brew "htop"                                 # Interactive system-monitor
brew "graphicsmagick"                       # GraphicsMagick image processor
brew "imagemagick"                          # ImageMagick image processor
brew "jpegoptim"                            # JPEG compressor/optimizer
brew "less"                                 # Terminal pager
brew "lesspipe"                             # Input filter for `less`
brew "micro"                                # Micro text editor
brew "npm"                                  # Node package manager
brew "optipng"                              # PNG compressor/optimizer
brew "tidy-html5"                           # HTML corrector
brew "neofetch"                             # System information tool
brew "python@3.x"                           # Python 3.x
brew "pipenv"                               # Python packaging tool
brew "pyenv"                                # Python version manager
brew "pyenv-virtualenv"                     # virtualenv and conda manager
brew "ripgrep"                              # Recursive Regex search tool
brew "rsync"                                # File transfer and sync tool
brew "screenfetch"                          # Screenshot information tool
brew "starship"                             # Starship cross-shell prompt
brew "telnet"                               # Virtual terminal client
brew "tmuxinator"                           # Tmux session controller
brew "unison"                               # Unison file synchronizer
brew "wget"                                 # Web content downloader
brew "zlib"                                 # Lossless data-compression library
brew "chezmoi"                              # Chezmoi dotfiles manager
brew "hugo"                                 # Static website generator
brew "lazygit"                              # Git in the console for the lazy
brew "lazydocker"                           # Docker in the console for the lazy
brew "fontbase"                             # Font management made awesome

cask "font-fira-code-nerd-font"             # Fira Code Nerd Font
cask "font-hack-nerd-font"                  # Hack Mono Nerd Font
cask "font-source-code-pro"                 # Source Code Pro Mono Nerd Font
cask "powershell"                           # Cross-platform shell
